
{
    "water_testing": "Test water every 15 days for pH, DO, ammonia and nitrate levels.",
    "liming": "Apply agricultural lime 250 kg/acre during pond preparation or after water pH drops.",
    "stocking_density": "Maintain appropriate stocking density to reduce stress and disease risk.",
    "record_keeping": "Always keep records of feed, growth, water quality and treatments.",
    "hello": "Hello! How can I assist you with fish farming today?",
    "hi": "Hi there! How can I help you with your fish farming questions?",
    "what food does pangasius fish need": "Pangasius fish (Pangas) are usually fed floating pellet feeds containing around 25-28% protein. They should be fed twice daily and feed quantity should be adjusted based on body weight and age stage. Good quality commercial feeds help in faster growth and disease prevention.",
    "which fish are cultivated in bangladesh": "In Bangladesh, many fish species are cultivated including indigenous major carps like Catla (Catla catla), Rohu (Labeo rohita), Mrigal (Cirrhinus mrigala), and Kalbaush (Labeo calbasu). Exotic carps such as Silver carp, Grass carp, and Common carp are also popular. Additionally, Pangas (Pangasius hypophthalmus), Tilapia, and indigenous small fish species are commonly farmed.",
    "what food is needed for rohu fish": "Rohu fish (Labeo rohita) are usually fed a combination of rice bran, mustard oil cake, and commercially prepared floating or sinking feed containing 22-28% protein. Balanced feeding ensures optimal growth.",
    "what is the ideal water quality for fish farming": "Ideal water quality includes pH between 6.5 to 8.5, dissolved oxygen (DO) above 5 mg/L, ammonia less than 0.05 mg/L, and temperature between 26°C to 30°C for most fish species. Regular water exchange and aeration are important.",
    "how long does it take pangasius to grow": "Under proper feeding and good water conditions, Pangasius can reach market size (800g to 1kg) within 5 to 6 months in Bangladesh pond systems.",
    "how long does it take rohu fish to grow": "Rohu fish generally take 10-12 months to reach 700g to 1kg under semi-intensive or intensive pond culture with proper feeding.",
    "what causes fish disease": "Poor water quality, overstocking, lack of oxygen, irregular feeding, and unhygienic pond management are major causes of fish diseases like bacterial infections, fin rot, and fungal infections.",
    "how to prevent fish disease": "To prevent fish diseases, maintain clean water with regular pond cleaning, proper aeration, do not overfeed, avoid overcrowding, and regularly observe fish behavior. Prophylactic treatments using lime and potassium permanganate are also helpful.",
    "can you give feeding chart": "Sure! Example feeding chart: (1) 0-2 months: 10-12% of body weight, (2) 2-4 months: 6-8%, (3) 4-6 months: 4-5%, (4) after 6 months: 2-3% of body weight. Adjust feeding based on fish appetite and water quality.",
    "how can i sell fish fry": "You can sell fish fry through local hatcheries, markets, or by using online fish farming platforms. Our system also includes a fry buy-sell section where you can post your fry for sale to reach more farmers.",
    "what is composite fish farming": "Composite fish farming involves culturing multiple fish species together in the same pond that utilize different levels of pond ecology, such as surface feeders (Catla), column feeders (Rohu), and bottom feeders (Mrigal) to maximize production from the pond.",
    "what are signs of unhealthy fish": "Unhealthy fish may show signs like abnormal swimming, reduced feeding, wounds on body, discoloration, damaged fins, or surface gasping. Immediate action is necessary if these signs are noticed.",
    "what to do if fish stop eating": "If fish stop eating, check water quality parameters immediately. High ammonia, low oxygen, or disease may cause this. Reduce feed temporarily, improve water quality, and monitor closely. Consult with a fisheries expert if needed.",
    "what fish is best for quick harvest": "Pangasius and Tilapia are fast-growing species in Bangladesh that can be harvested within 5-6 months under proper management. These species are popular for their fast growth and high survival rates.",
    "what type of feed helps faster fish growth": "High-quality commercial pellet feed with balanced protein (25-35%), vitamins, and minerals ensures faster fish growth. Using floating feed also allows better observation of fish feeding activity.",
    "pangasius food": "Pangasius fish should be fed floating pellets with 25-28% protein, twice daily for healthy growth.",
    "what to eat with pangasius fish": "Pangasius fish need commercial floating feed with proper protein and minerals, ideally 25-28% protein.",
    "pangasius feed": "For Pangasius, floating commercial pellets ensure fast growth with low disease risk.",
    "pangasius diet": "Balanced diet for Pangasius includes high-quality commercial feed twice daily.",
    "how to prepare pond for fish farming": "Clean and dry the pond, apply lime (250-300 kg/acre), fertilize with cow dung (500 kg/acre), then fill with water and stock fingerlings after 7-10 days.",
    "what is the stocking density for tilapia": "Stocking density for Tilapia is around 3,000–5,000 fish per acre depending on management and water quality.",
    "how often should i feed tilapia": "Tilapia should be fed 2-3 times daily with floating pellet feed containing 24-30% protein.",
    "what fertilizer is best for fish pond": "A mix of cow dung (500 kg/acre/month), urea (40 kg), and TSP (20 kg) is commonly used in Bangladesh.",
    "how to control fish disease": "Maintain clean water, avoid overfeeding, use lime and potassium permanganate, and apply probiotics or medicine as needed.",
    "what is the growth period of rui fish": "Rui (Rohu) fish generally reach market size in 9-12 months under good culture conditions.",
    "can i farm koi in small pond": "Yes, Koi (climbing perch) is suitable for small ponds due to its air-breathing ability and fast growth.",
    "how to increase fish growth rate": "Ensure good water quality, feed with quality protein-rich feed, maintain optimal stocking density, and monitor fish health regularly.",
    "when should i apply lime in fish pond": "Lime should be applied during pond preparation or when pH drops below 6.5. Recommended dose is 250–300 kg/acre.",
    "what is the water temperature for tilapia": "Ideal water temperature for Tilapia is between 26°C to 30°C for optimal growth.",
    "fish": "In Bangladesh, common fish species for farming include Rui, Katla, Mrigal, Pangas, Tilapia, Silver Carp, Grass Carp, and Koi.",
    "feed": "Fish feed includes floating or sinking pellets with 24-30% protein. The type and frequency depend on fish species and age.",
    "farm": "Fish farming in Bangladesh includes pond preparation, liming, fertilization, stocking fingerlings, regular feeding, and water management.",
    "tilapia": "Tilapia grows well in warm water (26–30°C), requires pH 6.5–8.5, and should be fed 2–3 times daily with protein-rich floating feed.",
    "rui": "Rui (Rohu) is a popular carp species in Bangladesh. It grows best in ponds with pH 6.5–7.5 and takes around 9–12 months to reach market size.",
    "katla": "Katla fish grows fast in warm freshwater ponds. Feed it twice daily and maintain clean water with good oxygen levels (above 5 mg/L).",
    "pangas": "Pangasius (Pangas) can grow rapidly in 5–6 months. It needs high-protein feed and proper pond aeration.",
    "koi": "Koi (climbing perch) is suitable for high-density stocking in small ponds. It grows fast and survives in low oxygen levels.",
    "fish feed": "Different fish need different feeds. For example, Rui eats floating feed with 25-30% protein.",
    "fish growth": "Fish growth depends on water quality, feed, and species. Rui usually takes 9-12 months.",
    "greeting": "Hello! How can I help you with fish farming?",
    "fish info": "We farm Rui, Katla, Pangas, Tilapia, Koi and others in Bangladesh.",
    "water quality": "Ideal water conditions: pH 6.5-8.5, temperature 26-30°C, oxygen >5 mg/L.",
    "pond preparation": "Dry and clean the pond, apply lime and cow dung, then fertilize before stocking.",
    "a": "Could you please ask a complete question related to fish farming?",
    "b": "It seems like you entered a random letter. Feel free to ask about fish farming topics.",
    "c": "This appears to be an incomplete message. Please ask your question clearly about fish care, feeding, or water quality.",
    "ok": "Glad to hear that! Whenever you have any questions about fish farming, just ask me.",
    "yes": "Noted! Let me know if you have any specific questions on fish farming or water management.",
    "no": "Alright. If you change your mind, I'm here to help with fish farming information.",
    "xyz": "I'm not sure what you meant by 'xyz'. You can ask me things like fish feeding, water care, or selling fry.",
    "test": "I'm active! You can ask about fish growth, feed types, disease prevention, or market advice.",
    "random": "I’m designed to assist with fish farming. Please feel free to ask relevant questions to get proper answers.",
    "why": "Could you please clarify your question? I can help with fish farming guidance, feeding tips, and water advice.",
    "help": "I’m here to help with fish species advice, feeding schedules, disease prevention, and pond management."
}


